# GetOrCreateElementIdForExternalDefinition Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeParameters..::..GetOrCreateElementIdForExternalDefinition Method
RebarShapeParameters Class See Also
---
Retrieve the ElementId corresponding to an external rebar shape parameter in the document, if it exists; otherwise, add the parameter to the document and generate a new ElementId.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ElementId GetOrCreateElementIdForExternalDefinition(
	Document doc,
	ExternalDefinition externalDefinition
)
```

Visual Basic
---
```text
Public Shared Function GetOrCreateElementIdForExternalDefinition ( _
	doc As Document, _
	externalDefinition As ExternalDefinition _
) As ElementId
```

Visual C++
---
```text
public:
static ElementId^ GetOrCreateElementIdForExternalDefinition(
	Document^ doc,
	ExternalDefinition^ externalDefinition
)
```

# ### Parameters
doc
    Type: Autodesk.Revit.DB..::..DocumentA document.
externalDefinition
    Type: Autodesk.Revit.DB..::..ExternalDefinitionA shared parameter.
# ### Return Value
An ElementId representing the shared parameter stored in the document.
# Remarks
Before a parameter can be used in a RebarShapeDefinition, it must exist in the definition's document. There are two ways to achieve this. It can be bound to one or more categories in the document using the Document.ParameterBindings property, or it can be created with this method.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was nullNothingnullptra null reference (Nothing in Visual Basic). |

# See Also
RebarShapeParameters Class
Autodesk.Revit.DB.Structure Namespace